import { defineMessages } from 'react-intl'

const scope = 'app.commerce.privacy'
const privacyMessage = defineMessages({
  privacy: {
    id: `${scope}.privacy`,
    defaultMessage: 'حریم خصوصی',
  },
  privacyDesc1: {
    id: `${scope}.privacyDesc1`,
    defaultMessage: `دارتیل با تاکید بر احترامی که برای حریم شخصی کاربران قائل است، برای خرید، ثبت نظر یا
    استفاده از برخی امکانات وب‌سایت اطلاعاتی را از کاربران درخواست می‌کند تا بتواند خدماتی امن
    و مطمئن را به کاربران ارائه دهد. برای پردازش و ارسال سفارش، اطلاعاتی مانند آدرس، شماره
    تلفن و ایمیل مورد نیاز است و از آنجا که کلیه فعالیت‌های دارتیل قانونی و مبتنی بر قوانین
    تجارت الکترونیک صورت می‌گیرد و طی فرایند خرید، فاکتور رسمی و بنا به درخواست مشتریان حقوقی
    گواهی ارزش افزوده صادر می‌شود، از این رو وارد کردن اطلاعاتی مانند نام و کد ملی برای اشخاص
    حقیقی یا کد اقتصادی و شناسه ملی برای خریدهای سازمانی لازم است. یادآوری می‌شود آدرس ایمیل و
    تلفن‌هایی که مشتری در پروفایل خود ثبت می‌کند، تنها آدرس ایمیل و تلفن‌های رسمی و مورد تایید
    مشتری است و تمام مکاتبات و پاسخ‌های شرکت از طریق آنها صورت می‌گیرد.`,
  },
  privacyDesc2: {
    id: `${scope}.privacyDesc2`,
    defaultMessage: `بنابراین درج آدرس، ایمیل و شماره تماس‌های همراه و ثابت توسط مشتری، به منزله مورد تایید
    بودن صحت آنها است و در صورتی که موارد فوق به صورت صحیح یا کامل درج نشده باشد، دارتیل جهت
    اطمینان از صحت و قطعیت ثبت سفارش می‌تواند از مشتری، اطلاعات تکمیلی و بیشتری درخواست کند.`,
  },
  privacyDesc3: {
    id: `${scope}.privacyDesc3`,
    defaultMessage: `مشتریان می‌توانند نام، آدرس و تلفن شخص دیگری را برای تحویل گرفتن سفارش وارد کنند و دارتیل
    تنها برای ارسال همان سفارش، از این اطلاعات استفاده خواهد کرد.`,
  },
  privacyDesc4: {
    id: `${scope}.privacyDesc4`,
    defaultMessage: `همچنین دارتیل با نصب و یا استفاده از اپلیکشن با اخذ اجازه از کاربر اطلاعات زیر را به صورت
    ناشناس از کاربر اخذ می کند. این اطلاعات در حد ضرورت و متناسب با مقاصدی از جمله مطالعه علت
    گزارش خطا و بهبود اشکالات سیستمی و تجربه کاربری در هنگام استفاده از وبسایت و اپلیکیشن
    دارتیل و نیز تحقیقات بازاریابی و ارائه خدمات و پیشنهادات خرید مرتبط تر به کاربران جمع آوری
    می شود و به نحوی مورد استفاده قرار می‌گیرند که به طور مستقیم به یک شخص حقیقی مشخص و معین
    مرتبط نباشند.`,
  },
  privacyDesc5: {
    id: `${scope}.privacyDesc5`,
    defaultMessage: `نوع دستگاه، زبان و نوع سیستم عامل دستگاه شما، شناسه اندروید و شناسه تبلیغاتی اندروید
    ویژه دستگاه شما، جست‌وجوهای انجام شده در وب سایت و اپلیکشن دارتیل و نتایج انتخاب‌شده،
    مدت و بازه های استفاده شما از دارتیل، برنامه های نصب شده، اطلاعات فنی و گزارش‌های سرور
    شامل نوع شبکه و نوع و نسخه مرورگر این اطلاعات تنها توسط دارتیل استفاده شده و در اختیار
    شریک تجاری دیگری قرار نمی گیرد. همچنین در صورت درخواست کاربر اطلاعات قبلی پاک شده و پس
    از آن این اطلاعات جمع آوری نمی گردد. در صورت بروز وقفه (Crashes) نیز اطلاعات زیر جهت
    مطالعه علت بروز وققه و رفع خطا جمع آوری می گردد.`,
  },
  privacyDesc6: {
    id: `${scope}.privacyDesc6`,
    defaultMessage: `وضعیت روت بودن یا نبودن دستگاه، میزان کل رم و میزان فضای پر آن هنگام وقفه، روز و ساعت
    رخدادها، خاموش یا روشن بودن شبکه بی‌سیم، خاموش یا روشن بودن شبکه دیتا، خاموش یا روشن
    بودن وضعیت رومینگ.`,
  },
  privacyDesc7: {
    id: `${scope}.privacyDesc7`,
    defaultMessage: `دارتیل اطلاعات را توسط کوکی (cookie) جمع آوری می کند. کوکی فایلی است که به درخواست یک
    سایت، توسط مرورگر ایجاد می‌شود و به سایت امکان ذخیره بازدید‌های شما و مناسب‌سازی آنها را
    فراهم می‌نماید. بسیاری از مرورگرها امکان غیرفعال کردن کوکی را فراهم کرده‌اند، به این منظور
    می‌توانید راهنمای مرورگرها را مطالعه کنید. دارتیل برای اطلاع‌رسانی رویدادها و اخبار، خدمات
    و سرویس‌های ویژه یا پروموشن‌ها، برای اعضای وب‌سایت ایمیل یا پیامک ارسال نماید. در صورتی که
    کاربران تمایل به دریافت اینگونه ایمیل‌ها و پیامک‌ها نداشته باشند، می‌توانند عضویت دریافت
    خبرنامه دارتیل را در پروفایل خود لغو کنند. عدم اقدام جهت لغو، به منزله ی موافقت ضمنی با
    دریافت ایمیل‌ها و پیام‌ها و سلب حق اعتراض می‌باشد.`,
  },
  privacyDesc8: {
    id: `${scope}.privacyDesc8`,
    defaultMessage: `دارتیل ممکن است نقد و نظرهای ارسالی کاربران را در راستای رعایت قوانین وب سایت ویرایش کند.
    همچنین اگر نظر یا پیام ارسال شده توسط کاربر، مشمول مصادیق محتوای مجرمانه باشد، دارتیل
    می‌تواند از اطلاعات ثبت‌شده برای پیگیری قانونی استفاده کند. کاربران ضمن استفاده از خدمات
    وب‌سایت دارتیل، حق ویرایش اطلاعات و استفاده از آنها را در چارچوب فوق‌الذکر به دارتیل اعطا
    نموده و حق اعتراض را از خود سلب می‌نمایند.`,
  },
  privacyDesc9: {
    id: `${scope}.privacyDesc9`,
    defaultMessage: `باید تاکید شود که حفظ و نگهداری رمز عبور و نام کاربری بر عهده کاربران است و لذا برای
    جلوگیری از هرگونه سواستفاده احتمالی، کاربران نباید آن اطلاعات را برای شخص دیگری فاش کنند.
    در صورتی که کاربر شماره همراه خود را به فردی دیگر واگذار کرد، جهت جلوگیری از سواستفاده یا
    مشکلات احتمالی کاربران باید شماره موبایل خود را در پروفایل تغییر داده و شماره جدیدی ثبت
    نمایند.`,
  },
  privacyDesc10: {
    id: `${scope}.privacyDesc10`,
    defaultMessage: `مسئولیت هرگونه خسارت احتمالی که ناشی از عدم رعایت موارد فوق‌الذکر توسط کاربر باشد، با خود
    کاربر بوده وکاربر حق هر گونه ادعا علیه دارتیل را از خود سلب می‌کند. دارتیل هویت شخصی
    کاربران را محرمانه می‌داند و اطلاعات شخصی آنان را به هیچ شخص یا سازمان دیگری منتقل
    نمی‌کند، مگر اینکه با حکم مقام قضایی یا اداری صالحه یا طبق قوانین و مقررات رایج کشور موظف
    باشد در اختیار مراجع ذی‌صلاح قرار دهد.در این موارد هیچ گونه مسئولیت قانونی مبنی بر جبران
    خسارت برای دارتیل وجود ندارد و کاربران با اعلام رضایت خود در استفاده از خدمات وب سایت ضمنا
    حق هرگونه اعتراض را از خود سلب نموده اند.`,
  },
  privacyDesc11: {
    id: `${scope}.privacyDesc11`,
    defaultMessage: `همچنین بدین وسیله به اطلاع کاربران رسانده می‌شود که دارتیل همانند سایر وب‌سایت‌ها از
    جمع‌آوری IP و کوکی‌ها استفاده می‌کند، کوکی فایلی است که به درخواست یک سایت، توسط مرورگر
    ایجاد می‌شود و به سایت امکان ذخیره بازدید‌های شما و مناسب‌سازی آنها را فراهم می‌نماید.
    بسیاری از مرورگرها امکان غیرفعال کردن کوکی را فراهم کرده‌اند، به این منظور می‌توانید
    راهنمای مرورگرها را مطالعه کنید. اما پروتکل، سرور و لایه‌های امنیتی دارتیل و روش‌های مناسب
    مدیریت داده‌ها حداکثر تلاش را به عمل می‌آورد که اطلاعات کاربران را محافظت و از دسترسی‌های
    غیرقانونی جلوگیری کند. طبیعتا مسئولیت هرگونه سواستفاده به شخص یا اشخاص متخلف مربوط بوده و
    دارتیل حق اعتراض و پیگیری را از طریق قانونی بنابر صلاحدید خود محفوظ می‌دارد.`,
  },
  privacyDesc12: {
    id: `${scope}.privacyDesc12`,
    defaultMessage: `در صورتی که تمایلی به دریافت ایمیل‌ها و خبرنامه‌های دارتیل ندارید، می‌توانید بر روی کلمه
    لغو عضویت در انتهای صفحه ایمیل کلیک کنید.`,
  },
  privacyDesc13: {
    id: `${scope}.privacyDesc13`,
    defaultMessage: `دارتیل برای حفاظت و نگهداری اطلاعات و حریم شخصی کاربران همه توان خود را به کار می‌گیرد و
    امیدوار است که تجربه خریدی امن، راحت و خوشایند را برای همه کاربران فراهم آورد.`,
  },
  privacyDesc14: {
    id: `${scope}.privacyDesc14`,
    defaultMessage: `در صورت وجود هرگونه سوال، لطفا با اطلاعات تماس زیر ارتباط برقرار کنید.`,
  },
})

export default privacyMessage
